# Requirements:
# homebrew - http://brew.sh/
# brew bundle - https://github.com/Homebrew/homebrew-bundle
# cask - https://caskroom.github.io/ (installed automatically)
# mas-cli - https://github.com/argon/mas
cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/versions'

tap 'homebrew/core'

brew 'amazon-ecs-cli'
brew 'binutils'
brew 'coreutils'
brew 'cask'
brew 'direnv'
brew 'git'
brew 'lv'
brew 'go'
brew 'hub'
# brew 'libiconv'
# brew 'libxlst'
# brew 'libxml2'
brew 'jq'
brew 'mas'
brew 'rbenv'
brew 'rbenv-binstubs'
brew 'rbenv-gemset'
brew 'readline'
brew 'ruby-build'
brew 'tig'

brew 'go-jira'

# alternative to 'cat'
brew 'bat'
# better curl
brew 'httpie'

cask 'dropbox'
cask '1password'
cask 'alfred'
cask 'karabiner-elements'
# cask 'android-platform-tools'
cask 'appcleaner'
cask 'docker'
cask 'dash'
# curl -o dash_formula.rb -s https://raw.githubusercontent.com/Homebrew/homebrew-cask/baf4f35e70c225fe1a8a60ec3b4e22604187238d/Casks/dash.rb;brew install --cask dash_formula.rb;rm -f dash_formula.rb
cask 'electronic-wechat'
cask 'google-chrome'
# cask 'google-drive'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'java'
# cask 'nosleep'
# cask 'qq'
# cask 'sequel-pro'
cask 'slack'
cask 'postman'
cask 'sogouinput'
cask 'spectacle'
cask 'teamviewer'
cask 'virtualbox'
cask 'vagrant'
cask 'visual-studio-code'

cask 'intellij-idea'
cask 'microsoft-outlook'

tap caskroom/fonts
cask 'font-fira-code'

# td
brew 'socat'
brew 'geoip'
brew 'geoipupdate'
brew "mysql@5.7", restart_service: true, link: true, conflicts_with: ["mysql"]

brew 'peco'
brew 'awscli'
brew 'pre-commit'
brew 'envchain'

# quick look plugin
cask 'qlmarkdown'
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzip'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

cask 'notion'

tap 'facebook/fb'
brew 'buck'

mas 'Xcode', id: 497799835
mas 'Jira Cloud', id: 1475897096
mas 'Mindnode', id: 1218718027

# rbenv
# pyenv

# nvm
# curl -o- https://raw.githubusercontent.com/nvm-sh/nvm/v0.39.1/install.sh | bash