# Requirements:
# homebrew - http://brew.sh/
# brew bundle - https://github.com/Homebrew/homebrew-bundle
# cask - https://caskroom.github.io/ (installed automatically)
# mas-cli - https://github.com/argon/mas
cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/versions'

tap 'homebrew/core'

brew 'amazon-ecs-cli'
brew 'binutils'
brew 'coreutils'
brew 'cask'
brew 'direnv'
brew 'git'
brew 'go'
brew 'hub'
# brew 'libiconv'
# brew 'libxlst'
# brew 'libxml2'
brew 'jq'
brew 'mas'
brew 'rbenv'
brew 'rbenv-binstubs'
brew 'rbenv-gemset'
brew 'readline'
brew 'ruby-build'
brew 'tig'

cask '1password'
cask 'alfred'
cask 'karabiner'
# cask 'android-platform-tools'
cask 'appcleaner'
cask 'docker'
cask 'dash'
cask 'dropbox'
cask 'electronic-wechat'
cask 'google-chrome'
# cask 'google-drive'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'java'
# cask 'nosleep'
# cask 'qq'
cask 'sequel-pro'
cask 'slack'
cask 'postman'
cask 'sogouinput'
cask 'spectacle'
cask 'teamviewer'
cask 'vagrant'
cask 'visual-studio-code'

# quick look plugin
cask 'qlmarkdown'
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzip'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

tap 'facebook/fb'
brew 'buck'

mas 'Xcode', id: 497799835
